# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

a = [2, 3, 4, 5, 6]

def mult_(x: list)->list:
    y = []
    for i in range((len(x)+1)//2):
        m = x[i]*x[-i-1]
        y.append(m)
    return y
print (mult_(a)) 
        
        

