# Напишите программу, которая принимает на вход координаты двух точек и 
# находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21
import math
x = []
y = []
for i in range(2):
    k = int(input(f'{i+1} - точка: x = '))
    x.append(k)
    k = int(input(f'           y = '))
    y.append(k)
r = round(math.sqrt((x[1]-x[0])**2 + (y[1]-y[0])**2),3)
print(r)